


extern void Error(int, int);  //行数+错误编码

//***************************************************************
//******************错误信息表***********************************
//***************************************************************
/*
1000: "输入语句格式错误!;
 1001:   "变量类型错误! ;
1002:  "缺少引号!
 1003:   "引号内容错误!;
1004:  "缺少逗号! 错误位于第" ;
 1005: "输出语句格式错误! ;
1006:   "请使用逗号或分号! ;
 1007:  "未识别的变量名!
 1008:  "变量已经存在! 
 1009:   "出现因式无法处理的字符! 
 1010:   "函数无返回值! 
 1011:   "函数返回值类型错误!
 1012:  "未定义的函数! 
1013:  "缺少分号! 
 1014:   "0做分母! 
 1015:   "非int型求余!
 1016:   "因式错误! ;
 1017:   "赋值类型不匹配! 
 1018:   "等式错误! 
 1019:   "未识别的字符! 
 1020:  "()数量不匹配! 
 1021:  "{}数量不匹配! 
1022:  "引号数量不匹配! 
 1023:  "未定义的运算符! 
 1024:  "不符合min-c串运算要求！
1025:  "未找到函数！
1026:  "最后一个函数非main函数！
 1027:   "函数重定义！









*/

